Revit 2027 API
FabricationServiceButton.GetConditionLowerValue Method
 Gets the condition lower value (valid if greater or equal) for a given condition index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetConditionLowerValue(
	int condition
)
Public Function GetConditionLowerValue (
	condition As Integer
) As Double
public:
double GetConditionLowerValue(
	int condition
)
member GetConditionLowerValue :
        condition : int -> float
Parameters
condition Int32
 The condition index.
Return Value
Double
 The condition lower value.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The index condition is not larger or equal to 0 and less than ConditionCount.
Remarks
 A value of -1 indicates an unrestricted value.
See Also
Reference
FabricationServiceButton Class
Autodesk.Revit.DB Namespace